tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1828_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1828_H_
#define _PIC16LF1828_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define SSP1IF                        60
#define TXIF                          61
#define RCIF                          62
#define ADIF                          63
#define TMR1GIF                       64
#define PIR2                          65
#define CCP2IF                        66
#define BCL1IF                        67
#define EEIF                          68
#define C1IF                          69
#define C2IF                          70
#define OSFIF                         71
#define PIR3                          72
#define TMR4IF                        73
#define TMR6IF                        74
#define CCP3IF                        75
#define CCP4IF                        76
#define TMR0                          77
#define TMR1L                         78
#define TMR1H                         79
#define T1CON                         80
#define TMR1ON                        81
#define nT1SYNC                       82
#define T1OSCEN                       83
#define T1CKPS0                       84
#define T1CKPS                        85
#define T1CKPS1                       86
#define TMR1CS                        87
#define TMR1CS0                       88
#define TMR1CS1                       89
#define T1GCON                        90
#define T1GSS0                        91
#define T1GSS                         92
#define T1GSS1                        93
#define T1GVAL                        94
#define T1GGO_nDONE                   95
#define T1GGO                         96
#define T1GSPM                        97
#define T1GTM                         98
#define T1GPOL                        99
#define TMR1GE                        100
#define TMR2                          101
#define PR2                           102
#define T2CON                         103
#define T2CKPS0                       104
#define T2CKPS                        105
#define T2CKPS1                       106
#define TMR2ON                        107
#define T2OUTPS0                      108
#define T2OUTPS                       109
#define T2OUTPS1                      110
#define T2OUTPS2                      111
#define T2OUTPS3                      112
#define CPSCON0                       113
#define T0XCS                         114
#define CPSOUT                        115
#define CPSRNG                        116
#define CPSRNG0                       117
#define CPSRNG1                       118
#define CPSRM                         119
#define CPSON                         120
#define CPSCON1                       121
#define CPSCH                         122
#define CPSCH0                        123
#define CPSCH1                        124
#define CPSCH2                        125
#define CPSCH3                        126
#define TRISA                         127
#define TRISA0                        128
#define TRISA1                        129
#define TRISA2                        130
#define TRISA3                        131
#define TRISA4                        132
#define TRISA5                        133
#define TRISB                         134
#define TRISB4                        135
#define TRISB5                        136
#define TRISB6                        137
#define TRISB7                        138
#define TRISC                         139
#define TRISC0                        140
#define TRISC1                        141
#define TRISC2                        142
#define TRISC3                        143
#define TRISC4                        144
#define TRISC5                        145
#define TRISC6                        146
#define TRISC7                        147
#define PIE1                          148
#define TMR1IE                        149
#define TMR2IE                        150
#define CCP1IE                        151
#define SSP1IE                        152
#define TXIE                          153
#define RCIE                          154
#define ADIE                          155
#define TMR1GIE                       156
#define PIE2                          157
#define CCP2IE                        158
#define BCL1IE                        159
#define EEIE                          160
#define C1IE                          161
#define C2IE                          162
#define OSFIE                         163
#define PIE3                          164
#define TMR4IE                        165
#define TMR6IE                        166
#define CCP3IE                        167
#define CCP4IE                        168
#define OPTION_REG                    169
#define PS                            170
#define PS0                           171
#define PS1                           172
#define PS2                           173
#define PSA                           174
#define T0SE                          175
#define TMR0SE                        176
#define T0CS                          177
#define TMR0CS                        178
#define INTEDG                        179
#define nWPUEN                        180
#define PCON                          181
#define nBOR                          182
#define nPOR                          183
#define nRI                           184
#define nRMCLR                        185
#define STKUNF                        186
#define STKOVF                        187
#define WDTCON                        188
#define SWDTEN                        189
#define WDTPS                         190
#define WDTPS0                        191
#define WDTPS1                        192
#define WDTPS2                        193
#define WDTPS3                        194
#define WDTPS4                        195
#define OSCTUNE                       196
#define TUN0                          197
#define TUN                           198
#define TUN1                          199
#define TUN2                          200
#define TUN3                          201
#define TUN4                          202
#define TUN5                          203
#define OSCCON                        204
#define SCS0                          205
#define SCS                           206
#define SCS1                          207
#define IRCF                          208
#define IRCF0                         209
#define IRCF1                         210
#define IRCF2                         211
#define IRCF3                         212
#define SPLLEN                        213
#define OSCSTAT                       214
#define HFIOFS                        215
#define LFIOFR                        216
#define MFIOFR                        217
#define HFIOFL                        218
#define HFIOFR                        219
#define OSTS                          220
#define PLLR                          221
#define T1OSCR                        222
#define ADRESL                        223
#define ADRESH                        224
#define ADCON0                        225
#define ADON                          226
#define GO_nDONE                      227
#define GO                            228
#define ADGO                          229
#define CHS0                          230
#define CHS                           231
#define CHS1                          232
#define CHS2                          233
#define CHS3                          234
#define CHS4                          235
#define ADCON1                        236
#define ADPREF0                       237
#define ADPREF                        238
#define ADPREF1                       239
#define ADNREF                        240
#define ADCS0                         241
#define ADCS                          242
#define ADCS1                         243
#define ADCS2                         244
#define ADFM                          245
#define LATA                          246
#define LATA0                         247
#define LATA1                         248
#define LATA2                         249
#define LATA4                         250
#define LATA5                         251
#define LATB                          252
#define LATB4                         253
#define LATB5                         254
#define LATB6                         255
#define LATB7                         256
#define LATC                          257
#define LATC0                         258
#define LATC1                         259
#define LATC2                         260
#define LATC3                         261
#define LATC4                         262
#define LATC5                         263
#define LATC6                         264
#define LATC7                         265
#define CM1CON0                       266
#define C1SYNC                        267
#define C1HYS                         268
#define C1SP                          269
#define C1POL                         270
#define C1OE                          271
#define C1OUT                         272
#define C1ON                          273
#define CM1CON1                       274
#define C1NCH0                        275
#define C1NCH                         276
#define C1NCH1                        277
#define C1PCH                         278
#define C1PCH0                        279
#define C1PCH1                        280
#define C1INTN                        281
#define C1INTP                        282
#define CM2CON0                       283
#define C2SYNC                        284
#define C2HYS                         285
#define C2SP                          286
#define C2POL                         287
#define C2OE                          288
#define C2OUT                         289
#define C2ON                          290
#define CM2CON1                       291
#define C2NCH0                        292
#define C2NCH                         293
#define C2NCH1                        294
#define C2PCH                         295
#define C2PCH0                        296
#define C2PCH1                        297
#define C2INTN                        298
#define C2INTP                        299
#define CMOUT                         300
#define MC1OUT                        301
#define MC2OUT                        302
#define BORCON                        303
#define BORRDY                        304
#define SBOREN                        305
#define FVRCON                        306
#define ADFVR0                        307
#define ADFVR                         308
#define ADFVR1                        309
#define CDAFVR0                       310
#define CDAFVR                        311
#define CDAFVR1                       312
#define TSRNG                         313
#define TSEN                          314
#define FVRRDY                        315
#define FVREN                         316
#define DACCON0                       317
#define DACNSS                        318
#define DACPSS                        319
#define DACPSS0                       320
#define DACPSS1                       321
#define DACOE                         322
#define DACLPS                        323
#define DACEN                         324
#define DACCON1                       325
#define DACR0                         326
#define DACR                          327
#define DACR1                         328
#define DACR2                         329
#define DACR3                         330
#define DACR4                         331
#define SRCON0                        332
#define SRPR                          333
#define SRPS                          334
#define SRNQEN                        335
#define SRQEN                         336
#define SRCLK0                        337
#define SRCLK                         338
#define SRCLK1                        339
#define SRCLK2                        340
#define SRLEN                         341
#define SRCON1                        342
#define SRRC1E                        343
#define SRRC2E                        344
#define SRRCKE                        345
#define SRRPE                         346
#define SRSC1E                        347
#define SRSC2E                        348
#define SRSCKE                        349
#define SRSPE                         350
#define APFCON0                       351
#define TXCKSEL                       352
#define T1GSEL                        353
#define RXDTSEL                       354
#define APFCON1                       355
#define CCP2SEL                       356
#define P2BSEL                        357
#define P1CSEL                        358
#define P1DSEL                        359
#define ANSA0                         360
#define ANSELA                        361
#define ANSA1                         362
#define ANSA2                         363
#define ANSA4                         364
#define ANSELB                        365
#define ANSB4                         366
#define ANSB5                         367
#define ANSC0                         368
#define ANSELC                        369
#define ANSC1                         370
#define ANSC2                         371
#define ANSC3                         372
#define ANSC6                         373
#define ANSC7                         374
#define EEADRL                        375
#define EEADRH                        376
#define EEDATL                        377
#define EEDATH                        378
#define EECON1                        379
#define RD                            380
#define WR                            381
#define WREN                          382
#define WRERR                         383
#define FREE                          384
#define LWLO                          385
#define CFGS                          386
#define EEPGD                         387
#define EECON2                        388
#define RCREG                         389
#define TXREG                         390
#define SP1BRGL                       391
#define SPBRGL                        392
#define SP1BRGH                       393
#define SPBRGH                        394
#define RCSTA                         395
#define RX9D                          396
#define OERR                          397
#define FERR                          398
#define ADDEN                         399
#define CREN                          400
#define SREN                          401
#define RX9                           402
#define SPEN                          403
#define TXSTA                         404
#define TX9D                          405
#define TRMT                          406
#define BRGH                          407
#define SENDB                         408
#define SYNC                          409
#define TXEN                          410
#define TX9                           411
#define CSRC                          412
#define BAUDCON                       413
#define ABDEN                         414
#define WUE                           415
#define BRG16                         416
#define SCKP                          417
#define RCIDL                         418
#define ABDOVF                        419
#define WPUA0                         420
#define WPUA                          421
#define WPUA1                         422
#define WPUA2                         423
#define WPUA3                         424
#define WPUA4                         425
#define WPUA5                         426
#define WPUB                          427
#define WPUB4                         428
#define WPUB5                         429
#define WPUB6                         430
#define WPUB7                         431
#define WPUC0                         432
#define WPUC                          433
#define WPUC1                         434
#define WPUC2                         435
#define WPUC3                         436
#define WPUC4                         437
#define WPUC5                         438
#define WPUC6                         439
#define WPUC7                         440
#define SSP1BUF                       441
#define SSPBUF                        442
#define SSP1ADD                       443
#define SSPADD                        444
#define SSP1MSK                       445
#define SSPMSK                        446
#define SSP1STAT                      447
#define BF                            448
#define UA                            449
#define R_nW                          450
#define S                             451
#define P                             452
#define D_nA                          453
#define CKE                           454
#define SMP                           455
#define SSP1CON                       456
#define SSPM0                         457
#define SSPM                          458
#define SSPM1                         459
#define SSPM2                         460
#define SSPM3                         461
#define CKP                           462
#define SSPEN                         463
#define SSPOV                         464
#define WCOL                          465
#define SSP1CON2                      466
#define SEN                           467
#define RSEN                          468
#define PEN                           469
#define RCEN                          470
#define ACKEN                         471
#define ACKDT                         472
#define ACKSTAT                       473
#define GCEN                          474
#define SSP1CON3                      475
#define DHEN                          476
#define AHEN                          477
#define SBCDE                         478
#define SDAHT                         479
#define BOEN                          480
#define SCIE                          481
#define PCIE                          482
#define ACKTIM                        483
#define CCPR1L                        484
#define CCPR1H                        485
#define CCP1CON                       486
#define CCP1M0                        487
#define CCP1M                         488
#define CCP1M1                        489
#define CCP1M2                        490
#define CCP1M3                        491
#define DC1B                          492
#define DC1B0                         493
#define DC1B1                         494
#define P1M                           495
#define P1M0                          496
#define P1M1                          497
#define PWM1CON                       498
#define P1DC                          499
#define P1DC0                         500
#define P1DC1                         501
#define P1DC2                         502
#define P1DC3                         503
#define P1DC4                         504
#define P1DC5                         505
#define P1DC6                         506
#define P1RSEN                        507
#define PSS1BD                        508
#define PSS1BD0                       509
#define PSS1BD1                       510
#define PSS1AC                        511
#define PSS1AC0                       512
#define PSS1AC1                       513
#define CCP1AS                        514
#define CCP1AS0                       515
#define CCP1AS1                       516
#define CCP1AS2                       517
#define CCP1ASE                       518
#define PSTR1CON                      519
#define STR1A                         520
#define STR1B                         521
